"""
Программа получает на вход фразу, ваша задача — посчитать, из скольких слов состоит данная фраза.
Для удобства будем считать словом любую последовательность символов.
"""

print(len(input().split()))
