"""
Напишите программу, которая проверяет состоит ли введенная строка целиком из строчных букв

В качестве ответа необходимо вывести True, если условие выполняется,
во всех остальных случаях нужно вывести False
"""

print("True" if input().islower() else "False")
