"""
Создайте этот прекрасный рисунок

Старайтесь для переноса строк использовать экранированный символ "\n".
"""

print('/\\_/\\\n>^,^<\n / \\\n(|_|)_/')
