"""
Напишите программу, которая считывает слово, затем выводит фразу:

Что Вы сказали? [это слово]? Какое интересное слово
"""

w = input()
print("Что Вы сказали? {w}? Какое интересное слово".format(w=w))
