"""
Напишите программу, которая распечатает все натуральные числа от 25 до 14 включительно.

Каждое число следует выводить на отдельной строке.
"""

i = 25
while i >= 14:
    print(i)
    i -= 1
