"""
Напишите программу, которая распечатает все натуральные числа от 1 до 17 включительно.

Каждое число следует выводить на отдельной строке.
"""
i = 1
while i <= 17:
    print(i)
    i += 1