"""
У нас в наличии рюкзак, вместимость которого составляет n литров,
и наша задача — забить его до предела максимально возможно.
Нам поступают вещи, объем которых измеряется также в литрах,
и мы должны их складывать в наш рюкзак без возможности пропуска.
Как только суммарный объем вместе с новой добавляемой вещью превысит вместимость рюкзака,
ваша программа должна вывести слово "Довольно!" и затем на отдельных строчках суммарный объем вещей,
которые мы смогли упаковать в рюкзак, и их количество.

Входные данные
Число n – вместимость рюкзака. Далее идет произвольное количество строк – объем очередного предмета.

Выходные данные
Строка «Довольно!» и затем два числа – суммарный объем упакованных вещей и их количество.
Каждое значение выводится в отдельной строке.
"""

n, r = int(input()), []
while sum(r) <= n:
    r.append(int(input()))
print('Довольно!', sum(r[:-1]), len(r) - 1, sep='\n')
