"""
«Морской бой» - игра для двух участников, в которой игроки по очереди называют координаты на неизвестной им карте
соперника.
Если у соперника по этим координатам имеется корабль, то корабль или его часть «топится»,
а  попавший получает право сделать еще один ход. Цель игрока - первым поразить все корабли противника.

«Морской бой» очень популярен среди учеников одной физико-математической школы.
Ребята очень любят в него играть на переменах.
Вот и сейчас ученики Иннокентий и Емельян начали новую партию.

Правила, по которым ребята расставляют корабли перед началом партии, несколько отличаются от классических.
Во-первых, игра происходит на поле размером N×M, а не 10×10.
Во-вторых, число кораблей, их размер и форма выбираются ребятами перед партией - так играть намного интереснее.

Емельян уже расставил все свои корабли, кроме одного однопалубного. Такой корабль занимает ровно одну клетку.

Задана расстановка кораблей Емельяна. Найдите число способов поставить оставшийся однопалубный корабль.
При этом учитывайте, что по правилам его можно ставить только в ту клетку, все соседние с которой не заняты.
В этой задаче соседними считаются клетки, имеющие общую сторону.

Программа считывает два числа: N и M (1 ≤ N, M ≤ 100).
Последующие N строк описывают игровое поле - каждая из них содержит M символов.
Символом «.» (точка) обозначена свободная клетка, символом «*» (звездочка) - занятая кораблем.

Необходимо вывести на экран ответ на задачу
"""

n, m = map(int, input().split())  # ввод строки/стобцы
a = [[str(j) for j in input()] for i in range(n)]  # ввод поля боя
count = 0  # счетчик вариантов
for i in range(n):  # цикл по строкам поля
    for j in range(m):  # в нем цикл по столбцам
        if a[i][j] != '*':  # если текущая клетка не корабль
            for d in (-1, 1):  # то проход по соседям сверху-слева + снизу-справа
                ai = i + d  # адрес по строке сверху или снизу
                if 0 <= ai < n and a[ai][j] == '*':  # и если сосед в рамках поля и это корабль
                    break  # тогда завершаем цикл
                aj = j + d  # адрес по столбцу слева или справа
                if 0 <= aj < m and a[i][aj] == '*':  # и если адрес в рамках поля и это корабль
                    break  # тогда завершаем цикл
            else:
                count += 1  # если не было найдено кораблей по периметру счётчик +1
print(count)
