"""
Перед вами имеется пустая шахматная доска размером 8 на 8, на которой находится фигура ладьи.
Пустая клетка обозначается символом «-», ладья отображается символом «T» (английская буква).

Ваша задача — нарисовать шахматную доску и добавить на нее символы «+» в те позиции,
куда за один ход может переместиться ладья.

Ладья в шахматах — это такая фигура, которая может перемещаться на любое число клеток по вертикали или горизонтали.

Входными данными для этой задачи являются восемь строк, состоящих из 8 символов.
Только один символ будет являться значением «T» и обозначать фигуру ладьи на поле.
Все остальные символы во входных строках будут являться «-» и обозначать пустую клетку шахматного поля.

Ваша задача — вывести новый рисунок шахматной доски, добавив в него символы «+» в те места,
куда может прийти ладья за один ход.
"""

