"""
Напишите функцию exponentiation, которая принимает на вход целое число и выводит на экран через пробел квадрат и куб этого числа.

Ваша задача — написать только определение функции exponentiation. Вызов функции делать не нужно!
"""


def exponentiation(d):
    print(d ** 2, d ** 3)
